Autodesk.Revit.DB.Analysis.ConstructionType
This enumeration specifies the available analytical construction types
like external walls, windows etc. for use in the detailed analytical
energy model.
Since:
2011

Autodesk.Revit.DB.Analysis.ConstructionType.Skylight
A window in a roof in the space

Autodesk.Revit.DB.Analysis.ConstructionType.InteriorWindow
A window in an interior wall in the space

Autodesk.Revit.DB.Analysis.ConstructionType.ExteriorWindow
A window in an exterior wall in the space

Autodesk.Revit.DB.Analysis.ConstructionType.Door
A door in a wall in the space

Autodesk.Revit.DB.Analysis.ConstructionType.Floor
A floor below the space

Autodesk.Revit.DB.Analysis.ConstructionType.Ceiling
A ceiling over the space

Autodesk.Revit.DB.Analysis.ConstructionType.Roof
A roof over the space

Autodesk.Revit.DB.Analysis.ConstructionType.Slab
A slab below the space

Autodesk.Revit.DB.Analysis.ConstructionType.InteriorWall
An interior wall surrounding the space

Autodesk.Revit.DB.Analysis.ConstructionType.ExteriorWall
An exterior wall surrounding the space